package com.ntst.eat;

public class JiangSu {
    public static void main(String[] args) {
       
        // 定义菜单数组
        String[][] menu = {
            {"扬州炒饭", "小份", "大份"},
            {"徐州地锅鸡", "迷你", "小份", "中份", "大辣"},
            {"佛跳墙", "单人份", "双人份"},
            {"奥灶面", "普通", "加料"},
            {"无锡酱排骨", "小份", "大份"},
            {"江海第一鲜", "清蒸", "红烧"}
        };

        // 定义价格数组
        double[][] prices = {
            {35.0, 45.0},  // 扬州炒饭：小份35元，大份45元
            {48.0, 50.0, 55.0, 60.0},  // 徐州地锅鸡： "迷你", "小份", "中份", "大辣"
            {120.0, 220.0},  // 佛跳墙：单人份120元，双人份220元
            {28.0, 38.0},  // 奥灶面：普通28元，加料38元
            {65.0, 75.0},  // 无锡酱排骨：小份65元，大份75元
            {45.0, 50.0}   // 江海第一鲜：清蒸45元，红烧50元
        };
        System.out.println("~~~~~~~~~~本店菜单~~~~~~~~~~");
        // 遍历菜单数组
        for (int i = 0; i < menu.length; i++) {
            System.out.println(menu[i][0]);
            // 遍历价格数组
            for (int j = 1; j < menu[i].length; j++) {
                System.out.println(menu[i][j]+"--"+prices[i][j-1]+"元");             
        }    
    }
    System.out.println("沈彦彬");    
    }
    
}
